package com.dev.amr.amlakfile.utils

import com.dev.amr.amlakfile.data.hawk.Hawks

class GetListItem {

    private val countListItem = Hawks.getInt("countGetList")
    private lateinit var options: ArrayList<String>

    fun getListItem(): ArrayList<String> {

        when (countListItem) {
            1 -> {
                options = arrayListOf(
                    "مسکونی ویلایی", "مسکونی آپارتمان", "تجاری", "اداری", "انباری و سوله",
                    "صنعتی _ کارخانه", "باغ و ویلا", "کشاورزی و دامداری", "زمین با کاربری مسکونی",
                    "زمین با کاربری باغ و ویلا", "کلنگی", "هتل و اقامتی", "آموزشی و ورزشی",
                    "درمانی", "اقامتی", "غیره..."
                )
            }

            2 -> {
                options = arrayListOf(
                    "تک برگ مشاع", "تک برگ شش دانگ", "منگوله دار مشاع", "منگوله دار شش دانگ",
                    "آستان قدس", "اوقاف", "قولنامه ای", "بنچاق", "وکالتی", "غیره..."
                )
            }

            3 -> {
                options = arrayListOf(
                    "1403",
                    "1402",
                    "1401",
                    "1400",
                    "1399",
                    "1398",
                    "1397",
                    "1396",
                    "1395",
                    "1394",
                    "1393",
                    "1392",
                    "1391",
                    "1390",
                    "1389",
                    "1388",
                    "1387",
                    "1386",
                    "1385",
                    "1384",
                    "1383",
                    "1382",
                    "1381",
                    "1380",
                    "1379",
                    "1378",
                    "1377",
                    "1376",
                    "1375",
                    "1374",
                    "1373",
                    "1372",
                    "1371",
                    "1370",
                    "قبل از1370"
                )
            }

            4 -> {
                options = arrayListOf(
                    "زیرزمین", "همکف", "اول", "دوم", "سوم", "چهارم", "پنجم",
                    "ششم", "هفتم", "هشتم", "نهم", "دهم", "یازدهم", "دوازدهم",
                    "سیزدهم", "چهاردهم", "پانزدهم", "شانزدهم", "هفدهم", "هجدهم",
                    "نوزدهم", "بیست", "بیست و یک", "بیست و دو", "بیست و سه", "بیست و چهار",
                    "بیست و پنج", "بیست و شش", "بیست و هفت", "بیست و هشت", "بیست و نه",
                    "سی", "سی به بالا"
                )
            }

            5 -> {
                options = arrayListOf(
                    "بدون اتاق خواب",
                    "1 خوابه",
                    "2 خوابه",
                    "3 خوابه",
                    "4 خوابه",
                    "5 خوابه",
                    "6 خوابه",
                    "7 خوابه",
                    "8 خوابه",
                    "9 خوابه",
                    "10 خوابه",
                    "بیشتر از 10"
                )
            }

            6 -> {
                options = arrayListOf(
                    "6 دانگ",
                    "مشاع"
                )
            }

            7 -> {
                options = arrayListOf(
                    "ندارد",
                    "ایرانی",
                    "فرنگی",
                    "هردو (ایرانی - فرنگی)"
                )
            }

            8 -> {
                options = arrayListOf(
                    "سنگ", "آجرنما", "سیمان", "کامپوزیت", "آلمینیوم",
                    "سرامیک", "چوب", "کنیتکس", "شیشه", "غیره...",
                )
            }

            9 -> {
                options = arrayListOf(
                    "ام دی اف", "ممبران", "های گلاس", "فلزی", "فلزی با درب ام دی اف",
                    "چوب", "غیره...", "ندارد"
                )
            }

            10 -> {
                options = arrayListOf(
                    "شمالی", "جنوبی", "غربی", "شرقی"
                )
            }

            11 -> {
                options = arrayListOf(
                    "شمالی",
                    "شمال غربی",
                    "شمال شرقی",
                    "جنوبی",
                    "جنوب غربی",
                    "جنوب شرقی",
                    "غربی",
                    "شرقی"
                )
            }

            12 -> {
                options = arrayListOf(
                    "پارکت چوبی",
                    "پارکت لمینت",
                    "سنگ",
                    "سرامیک",
                    "PVC",
                    "موکت",
                    "سیمان",
                    "موزاییک",
                    "غیره ..."
                )
            }

            13 -> {
                options = arrayListOf(
                    "بخاری",
                    "داکت اسپیلت",
                    "اسپیلت",
                    "شوفاژ",
                    "پکیج",
                    "چیلر",
                    "فن کوییل",
                    "از کف",
                    "شومینه",
                    "غیره ...",
                    "ندارد"
                )
            }

            14 -> {
                options = arrayListOf(
                    "کولر آبی",
                    "کولر گازی",
                    "داکت اسپیلت",
                    "اسپیلت",
                    "چیلر",
                    "فن کوییل",
                    "غیره ...",
                    "ندارد"
                )
            }
        }
        return options
    }
}